In [135]:
import pandas as pd
import numpy as np

In [136]:

import numpy as np
data0 = [2,4,6.5,8]
arr0 = np.array(data0)

In [137]:
# pandas中的Series数据类型(参数)
s = pd.Series(data=[100, 'a', { 'dic1': 5 }],
              index=pd.Index(['id1', 20, 'third'], name='my_idx'),
              dtype='object',
              name='my_name')

In [138]:
s = pd.Series(["1","2","3","4"])

In [139]:
#.后方一串为属性
s.index.values

array([0, 1, 2, 3], dtype=int64)

In [140]:
type(s.values[0])

str

In [141]:
#系列指size值大小
s.size

4

In [142]:
s.shape

(4,)

In [143]:
# 任务3: 创建Dataframe类型的数据,并获取其索引，值及表大小(带"one"为字符串)
d = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}
df = pd.DataFrame(d)

In [144]:
#"作者"是key,后面一串是value函数返回值
d1 = {
    "作者":pd.Series(['余华','残雪','莫言']),
    "作品":pd.Series(['活着','暗夜','红高粱']),
    "价格":pd.Series([35,72,38])
}
df2 = pd.DataFrame(d1)

In [145]:
#索引
df2['作品']

0     活着
1     暗夜
2    红高粱
Name: 作品, dtype: object

In [146]:
df2[['作者','价格']]

   作者  价格
0  余华  35
1  残雪  72
2  莫言  38

In [147]:
df2.values

array([['余华', '活着', 35],
       ['残雪', '暗夜', 72],
       ['莫言', '红高粱', 38]], dtype=object)

In [148]:
贵州茅台原始数据 = pd.read_csv(R'data\600519.csv')

In [149]:
#按照列索引
贵州茅台原始数据['TURNOVER']

0        1410347008
1         463463008
2         194689000
3         177558000
4          86231000
           ...
4089     2694714080
4090    10663392512
4091     5239853056
4092     5581027328
4093     5227695104
Name: TURNOVER, Length: 4094, dtype: int64

In [150]:
贵州茅台原始数据[['TURNOVER','volume']]

         TURNOVER  volume
0      1410347008  406318
1       463463008  129647
2       194689000   53252
3       177558000   48013
4        86231000   23231
...           ...     ...
4089   2694714080   49076
4090  10663392512  204397
4091   5239853056   96885
4092   5581027328   98107
4093   5227695104   89157

[4094 rows x 2 columns]

In [151]:
#按照行索引（取得第一行）
贵州茅台原始数据.loc[0]

day           2001-08-27
STOCK_CODE       6005191
open               34.51
close              35.55
maximum            37.78
minimum            32.85
volume            406318
TURNOVER      1410347008
Name: 0, dtype: object

In [152]:
贵州茅台 = 贵州茅台原始数据.set_index('day')

In [153]:
贵州茅台.loc['2001-08-27',['open','close']]

open     34.51
close    35.55
Name: 2001-08-27, dtype: float64

In [154]:
贵州茅台.loc['2001-10-08',['open','close']]

open     37.00
close    36.58
Name: 2001-10-08, dtype: float64

In [155]:
#loc元素切片
贵州茅台.loc['2001-08-27':'2001-10-08','open']

day
2001-08-27    34.51
2001-08-28    34.99
2001-08-29    36.98
2001-08-30    36.28
2001-08-31    37.15
2001-09-03    37.20
2001-09-04    37.01
2001-09-05    37.61
2001-09-06    37.35
2001-09-07    36.50
2001-09-10    35.40
2001-09-11    36.80
2001-09-12    35.33
2001-09-13    36.01
2001-09-14    36.01
2001-09-17    36.08
2001-09-18    35.88
2001-09-19    36.30
2001-09-20    36.90
2001-09-21    36.28
2001-09-24    36.06
2001-09-25    36.28
2001-09-26    36.11
2001-09-27    36.08
2001-09-28    36.90
2001-10-08    37.00
Name: open, dtype: float64

In [156]:
#loc中能放五类值，行或列名字，切片，函数，布尔
条件1 = 贵州茅台['open'] < 35
条件2 = 贵州茅台['close'] < 35
布尔列表 = 条件1 & 条件2
贵州茅台.loc[布尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [157]:
#使用函数作为索引
def condition(pd):
   条件1 = pd['open'] < 35
   条件2 = pd['close'] < 35
   布尔列表 = 条件1 & 条件2
   return 布尔列表

In [158]:
贵州茅台.loc[condition]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [159]:
#查询数据
贵州茅台.query('open<35 and close <35')[['open','close']]

             open  close
day
2001-10-17  34.79  34.20
2001-10-18  34.20  34.04
2001-10-19  34.00  33.50
2001-10-22  33.30  32.79
2001-11-08  33.35  33.70
...           ...    ...
2004-09-21  32.09  32.30
2004-09-22  32.03  32.16
2004-09-23  32.11  33.42
2004-09-24  33.60  34.49
2004-09-27  34.95  34.93

[498 rows x 2 columns]

In [160]:
#在数据框中抽样
贵州茅台.sample(10)

            STOCK_CODE    open   close  maximum  minimum  volume    TURNOVER
day
2014-03-04     6005191  152.12  153.40   159.29   152.00   50867   795957008
2003-01-13     6005191   25.20   25.37    25.50    25.20    1404     3560912
2002-04-25     6005191   35.10   35.51    35.68    35.10    2597     9206508
2016-01-04     6005191  218.00  210.02   218.00   209.99   17350   371909824
2007-01-08     6005191   86.30   84.86    86.60    83.88   48924   417405504
2017-01-26     6005191  348.14  344.42   348.80   341.30   37826  1303262144
2012-06-12     6005191  234.21  233.85   236.49   232.13   16373   382922352
2010-07-21     6005191  136.51  137.88   140.40   136.51   24363   338324512
2003-05-22     6005191   24.61   24.90    24.99    24.60    3099     7672879
2008-01-21     6005191  215.45  211.01   217.28   207.00   24987   531115488

In [161]:
#info函数显示信息
贵州茅台.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4094 entries, 2001-08-27 to 2018-11-02
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STOCK_CODE  4094 non-null   int64
 1   open        4094 non-null   float64
 2   close       4094 non-null   float64
 3   maximum     4094 non-null   float64
 4   minimum     4094 non-null   float64
 5   volume      4094 non-null   int64
 6   TURNOVER    4094 non-null   int64
dtypes: float64(4), int64(3)
memory usage: 384.9+ KB

In [162]:
#只对某特定的变量进行描述（describe函数）
贵州茅台['open'].describe

<bound method NDFrame.describe of day
2001-08-27     34.51
2001-08-28     34.99
2001-08-29     36.98
2001-08-30     36.28
2001-08-31     37.15
               ...
2018-10-29    549.09
2018-10-30    510.00
2018-10-31    527.00
2018-11-01    555.00
2018-11-02    585.00
Name: open, Length: 4094, dtype: float64>

In [163]:
#唯一值函数,每一个不同值出现的次数
result = 贵州茅台['open'].unique

In [164]:
result2 = 贵州茅台['open'].nunique

In [165]:
result3 = 贵州茅台['open'].value_counts()

In [170]:
#DF数据分组
df = pd.DataFrame({
    "name": ["A", "B", "C", "B", "C", "A", "C"],
    "value": [1, 3, 7, 2, 4, 3, 1]
})